{"i": {"ques": "Что такое HTML", "result": "\n\tHTML (Hyper Text Markup Language) - это язык разметки гипертекста, \n\tиспользуемый для создания веб-страниц. Он определяет структуру веб-страницы, \n\tразмещая текст, изображения и другие элементы на странице. С помощью HTML \n\tможно создать заголовки, абзацы, списки, таблицы и многие другие элементы. \n\tКроме того, HTML позволяет добавлять ссылки на другие веб-страницы или ресурсы, \n\tтакие как изображения или видео. Таким образом, HTML является основным языком, \n\tиспользуемым для создания веб-сайтов и веб-приложений.\n"}, "sl": {"ques": "Что такое HTML-элемент? Какова его структура?", "result": "\n\tHTML-элемент - это структурная единица HTML-документа. Он представляет собой контейнер,\n\tкоторый может содержать другие элементы, текст, изображения и т. д. Структура \n\tHTML-элемента включает следующие атрибуты:\n\n\t-Имя - это строка, которая идентифицирует элемент. Например, <h1> обозначает \n\tзаголовок первого уровня.\n\n\t-Атрибуты - дополнительные параметры, которые могут быть использованы для \n\tнастройки элемента. Например, тег <img> может иметь атрибут src, указывающий \n\tна URL изображения.\n\n\t-Содержание - это текст или другие элементы, которые находятся внутри \n\tэлемента. Например, элемент <p> содержит текст абзаца.\n\n\tВсе эти элементы объединяются для создания структуры веб-страницы.\n"}, "t": {"ques": "Типы верстки", "result": "\n\t1.Фиксированная - все элементы на странице жесткои зафиксированы \n\tстатическими размерами,\tне меняют свой размер при изменении окна\n\n\t2.Резиновая - блоки меняют свой размер в зависимости от размера экрана,\n\tбез перестроения элементов\n\n\t3.Адаптивная - блоки меняют свой размер и расположение при достижении \n\tопределенного размера экрана, но не тянуться при ресайзе окна\n\n\t4.Отзывчивая - совмещает в себе резиновую и адаптивную верстку\n"}, "a": {"ques": "Что такое атрибуты в HTML", "result": "\n\tАтрибуты в HTML - это дополнительные параметры, которые можно использовать \n\tдля настройки элементов. Они указываются в открывающем теге элемента, и их \n\tзначения заключаются в двойные кавычки. Например:\n\n\tАтрибуты могут использоваться для определения размера, положения, стиля и \n\tдругих свойств элементов. Они также могут быть использованы для добавления \n\tдополнительной информации о содержимом элемента, такой как заголовок или \n\tальтернативный текст для изображений.\n"}, "g": {"ques": "Глобальные атрибуты есть в HTML", "result": "\n\tВ HTML есть несколько глобальных атрибутов, которые могут использоваться \n\tв любом элементе. Вот некоторые из них:\n\n\tlang - указывает язык содержимого элемента.\n\n\tdir - определяет направление текста (ltr или rtl).\n\n\taccesskey - определяет клавишу для получения доступа к элементу (обычно \n\tпри нажатии Alt + указанная клавиша).\n\n\ttabindex - определяет порядок обхода элементов с помощью Tab.\n\n\ttitle - содержит текст всплывающей подсказки при наведении курсора на элемент.\n\n\tЭто только некоторые из доступных глобальных атрибутов. Полный список \n\tможно найти в спецификации HTML.\n"}, "k": {"ques": "Что такое категории контента в HTML5", "result": "\n\tВ HTML5 существует несколько категорий контента, которые определяют, как \n\tсодержимое должно быть отображено на экране. Некоторые из них включают:\n\n\t-Flow content: Это основная категория контента, которая включает элементы, \n\tтакие как теги <p>, <div>, и <span>. Эти элементы могут содержать другие \n\tэлементы или текст.\n\t-Phrasing content: Эта категория включает элементы, которые являются частью \n\tосновного контента, такие как заголовки, списки и таблицы.\n\t-Embedded content: Эта категория включает медиа-элементы, такие как видео\n\tи аудио, которые встраиваются в страницу.\n\t-Interactive content: Эта категория включает интерактивные элементы, такие \n\tкак кнопки и формы, которые позволяют пользователю взаимодействовать с \n\tвеб-страницей.\n\n\tКаждая категория имеет свои собственные атрибуты и стили, которые определяют, как контент отображается на экране.\n"}, "d": {"ques": "Что такое doctype? И для чего он используется", "result": "\n\tDoctype - это декларация типа документа, которая указывает, какой версией \n\tHTML или XHTML является документ. Он используется для того, чтобы сообщить \n\tбраузеру, какую версию HTML или XHTML следует использовать для отображения \n\tдокумента. Это также помогает обеспечить правильное отображение документа и \n\tпредотвращает появление ошибок, связанных с несовместимостью версий.\n"}, "st": {"ques": "Базовая структуру HTML-страницы", "result": "\n\tБазовая структура HTML-страницы обычно включает в себя следующие элементы:\n\t<!DOCTYPE html> - этот тег указывает тип документа и версию HTML.\n\t<html> - этот тег является корневым тегом для HTML-документа и включает все остальные теги.\n\t<head> - этот раздел содержит метаданные и инструкции для браузера.\n\t  -<title> - этот тег содержит заголовок страницы, который отображается в строке \n\tзаголовка браузера.\n\t  -meta - этот тег используется для указания метаинформации, такой как описание \n\tстраницы, ключевые слова и т.д.\n\t  -<link rel=\"stylesheet\" href=\"style.css\"> - этот тег подключает внешний CSS-файл, \n\tкоторый содержит стили для страницы.\n\t<body> - этот раздел содержит основное содержимое страницы.\n\t  -header - этот элемент содержит верхний колонтитул страницы, такой как логотип \n\t  или навигационное меню.\n"}, "v": {"ques": "Что такое валидация? Типы проверок HTML документа", "result": "\n\tВалидация - это процесс проверки правильности и соответствия стандартам HTML-кода.\n\n\tОсновные типы проверок:\n\n\t-Проверка на соответствие стандартам W3C (World Wide Web Consortium).\n\t-Проверка на наличие ошибок в коде (например, незакрытые теги, дублирующиеся \n\tидентификаторы и т.д.).\n\t-Проверка на совместимость с различными браузерами и устройствами.\n\t-Проверка на безопасность (отсутствие уязвимостей и кросс-браузерных проблем).\n"}, "s": {"ques": "Семантические теги", "result": "\n\tСемантика - это смысл и значение элементов HTML. Семантические теги - это теги, которые \n\tимеют конкретное значение и используются для описания структуры и содержания веб-страницы\n\n\t<article> - определяет независимое, автономное содержимое.\n\n\t<section> - определяет раздел в документе\n\n\t<header> - задает заголовок для документа или раздела:\n\t\tВ одном документе может быть несколько элементов <header> \n\n\t<article>\n\t<header>\n\t<h1>What Does WWF Do?</h1>\n\t<p>WWF's mission:</p>\n\t</header>\n\t<p>WWF's mission is to stop the degradation of our planet's natural environment,\n\tand build a future in which humans live in harmony with nature.</p>\n\t</article>\n\n\t<footer> - указывает нижний колонтитул для документа или раздела\n\tНижний колонтитул обычно содержит автора документа, информацию об авторском праве, \n\tссылки на условия использования, контактные данные\n\n\t<nav> - определяет набор навигационных ссылок.\n\n\t<nav>\n\t<a href=\"/html/\">HTML</a> |\n\t<a href=\"/css/\">CSS</a> |\n\t<a href=\"/js/\">JavaScript</a> |\n\t<a href=\"/jquery/\">jQuery</a>\n\t</nav>\n\n\t<aside> - определяет некоторое содержание в сторону от содержания \n\tон помещен в (как sidebar).Содержание <aside> должно быть связано с \n\tокружающим содержимым.\n\n\t<p>My family and I visited The Epcot center this summer.</p>\n\n\t<aside>\n\t<h4>Epcot Center</h4>\n\t<p>The Epcot Center is a theme park in Disney World, Florida.</p>\n\t</aside>\n\n\t<figure> и <figcaption> - добавление визуального пояснения к изображению\n\n\t<figure>\n\t<img src=\"pic_mountain.jpg\" alt=\"The Pulpit Rock\" width=\"304\" height=\"228\">\n\t<figcaption>Fig1. - The Pulpit Rock, Norway.</figcaption>\n\t</figure>\n\n\t<main> - Указывает основное содержимое документа\n\n\t<mark> - Определяет выделенный/выделенный текст\n\n\t<time> - Определяет дату и время\n\n\t<details> - Определяет дополнительные сведения, которые пользователь \n\tможет просматривать или скрывать\n"}, "f": {"ques": "Как семантически правильно сверстать картинку с подписью", "result": "\n\t<figure>\n        <img src=\"/path/to/image.jpg\" alt=\"Image description\">\n        <figcaption>Figure caption</figcaption>\n    </figure>\n"}, "l": {"ques": "Типы списков в HTML", "result": "\n\tВ HTML существует несколько типов списков:\n\n\t-неупорядоченные списки (unordered lists) - используются для перечисления \n\tпунктов, не имеющих определенного порядка. Для создания такого списка \n\tиспользуется тег <ul>;\n\n\t-упорядоченные списки (ordered lists) - используются для нумерации пунктов. \n\tТег для создания такого списка - <ol>;\n\n\t-определения списка (definition lists) - используются для создания списка, \n\tкаждый элемент которого состоит из двух частей: термина и его определения. \n\tТег для такого списка - <dl>.\n"}, "da": {"ques": "Разница между <script>, <script async> и <script defer>", "result": "\n\tРазница между тегами <script>, <script async> и <script defer> заключается в том,\n\tкак браузер обрабатывает код, содержащийся в этих тегах.\n\n\tТег <script> указывает браузеру на необходимость загрузить и выполнить указанный \n\tскрипт. Браузер загружает скрипт и выполняет его сразу же, как только он полностью \n\tзагружен. Это означает, что если скрипт большой и занимает много времени для загрузки, \n\tэто может замедлить загрузку остальной части страницы.\n\n\tТег <script async> указывает браузеру, что скрипт должен загружаться асинхронно, \n\tт.е. браузер начинает загрузку скрипта сразу же, но не ждет, пока он полностью \n\tзагрузится, прежде чем продолжить загрузку и выполнение остальной части страницы.\n\n\tЭто может ускорить загрузку страницы, поскольку браузер может начать загрузку других \n\tресурсов, пока скрипт еще загружается.\n\n\tОднако, этот подход имеет недостаток: поскольку скрипт загружается асинхронно, он \n\tможет начать выполняться до того, как он полностью загружен, что может привести к\n\tошибкам и неправильному поведению.\n\n\tАтрибут defer указывает браузеру отложить выполнение скрипта до тех пор, \n\tпока не будет завершен разбор HTML-документа.\n"}, "dl": {"ques": "Тег <datalist>", "result": "\n\n\tЭлемент <datalist> используется для создания выпадающего списка с предварительно выбранными значениями. \n\tОн позволяет пользователю выбрать значение из списка, а затем отправить его вместе с формой.\n\n\t<label for=\"country\">Country:</label>\n\t<input list=\"countries\" id=\"country\" name=\"country\">\n\t<datalist id=\"countries\">\n\t  <option value=\"Afghanistan\">\n\t  <option value=\"Albania\">\n\t  <option value=\"Algeria\">\n\t  ...\n\t</datalist>\n"}, "z": {"ques": "<link> для подключения CSS внутри тэга <head>, а <script> JS ставить перед закрывающимся тэгом </body>", "result": "\n\n\tПодключение CSS внутри тега <head> является хорошей практикой, так как это \n\tпозволяет браузеру начать парсинг и применение стилей сразу после загрузки \n\tдокумента. Это ускоряет процесс визуализации страницы и делает его более \n\tплавным для пользователя.\n\n\tС другой стороны, подключение JS перед закрывающимся тегом </body> позволяет \n\tзагрузить и выполнить скрипт после загрузки всего содержимого страницы. Это \n\tпомогает избежать проблем с блокировкой рендеринга и улучшить производительность, \n\tтак как браузер может продолжать загрузку и обработку страницы, пока JS еще выполняется.\n"}, "m": {"ques": "Что такое мета-тэги", "result": "\n\n\tМета-теги - это специальные HTML-теги, которые используются для предоставления \n\tинформации о веб-странице или сайте. Они обычно располагаются в разделе head документа \n\tи не отображаются в видимой части страницы. Некоторые распространенные примеры \n\tмета-тегов включают:\n\n\t-Title - используется для определения заголовка веб-страницы, который отображается \n\tв строке заголовка браузера и поисковых систем.\n\n\t-Description - используется для описания содержания страницы, которое может быть \n\tиспользовано поисковыми системами при создании краткого описания страницы в результатах поиска.\n\n\t-Keywords - устаревший тег, который использовался для указания списка ключевых слов, \n\tсвязанных с веб-страницей. В настоящее время поисковые системы редко используют этот тег.\n\n\t-Author - тег, используемый для указания автора или создателей веб-страницы.\n\n\t-Robots - тег для указания правил индексации страницы поисковыми роботами.\n"}, "w": {"ques": "meta-тег с name=viewport", "result": "\n\tMeta-тег viewport используется для указания размеров и ориентации экрана мобильного \n\tустройства или планшета, на котором отображается веб-страница. Это позволяет \n\tвеб-приложению адаптировать свой интерфейс для лучшего отображения на различных устройствах.\n\n\tВот пример использования meta-тега viewport:\n\t<meta name=\"viewport\" content=\"width=device-width, initial-scale=1.0\">\n\n\tЭтот тег говорит браузеру устройства, что ширина веб-страницы должна быть равна ширине \n\tэкрана устройства, и что масштаб страницы должен быть установлен на 100%.\n"}, "cv": {"ques": "Что такое элемент <canvas>", "result": "\n\n\t<canvas> - векторный\n\n\tЭлемент <canvas> используется для рисования 2D графики на веб-страницах. \n\tС его помощью можно создавать анимацию, игры, визуализировать данные и многое \n\tдругое. На канве можно рисовать линии, фигуры, текст, а также загружать изображения \n\tи работать с ними. Данные на канве можно обрабатывать с помощью JavaScript.\n"}, "av": {"ques": "Свойство valueAsNumber", "result": "\n\n\t<canvas> - векторный\n\n\tvalueAsNumber - это свойство, которое позволяет получить числовое значение\n\tэлемента input. Оно может быть полезно, если вы хотите работать с введенными \n\tданными как с числами, а не как со строками. Например, если у вас есть поле \n\tдля ввода числа, вы можете получить его значение с помощью valueAsNumber и \n\tвыполнить какие-то операции над ним.\n\n\t<input type=\"number\" valueAsNumber>\n"}, "tr": {"ques": "Что такое атрибут target", "result": "\n\n\tАтрибут target используется для указания окна или фрейма, в который должна \n\tзагружаться страница при выполнении ссылки.\n\n\tОн может принимать следующие значения:\n\n\t-_blank - открыть ссылку в новом окне\n\t-_self - загрузить ссылку в текущем окне\n\t-_parent - загрузить ссылку в родительском окне, если оно есть\n\t-_top - загрузить ссылку в верхнем уровне документа, если возможно\n\t-имя фрейма - загрузить ссылку в указанном фрейме\n"}, "ac": {"ques": "ApplicationCache в HTML5", "result": "\n\n\tApplication Cache (кэш приложений) в HTML5 - это механизм кэширования,\n\tкоторый позволяет сохранять веб-страницы и ресурсы на компьютере пользователя\n\tдля последующего использования без подключения к интернету. Он позволяет \n\tприложениям работать без доступа в интернет, а также сокращает время \n\tзагрузки при следующем посещении сайта.\n\n\t<!DOCTYPE html>\n\n\t<html manifest=\"cache.appcache\">\n\t<head>\n\t    <title>HTML5 AppCache Demo</title>\n\t</head>\n"}, "sc": {"ques": "Что такое srcset", "result": "\n\n\tSRCset - это атрибут тега <img>, который позволяет определить несколько \n\tисточников изображения для разных разрешений экрана. Он предоставляет \n\tнабор ресурсов разного размера, и браузер выбирает наиболее подходящий \n\tресурс в зависимости от текущего размера окна просмотра. Это позволяет \n\tоптимизировать загрузку изображений и улучшить производительность веб-страницы.\n\n\tРаботает SRCset следующим образом:\n\t1.Браузер считывает атрибут srcset и определяет размеры изображений, \n\tуказанных в списке.\n\n\t2.Браузер вычисляет ширину окна просмотра и сравнивает ее с \n\tуказанными размерами изображений.\n\n\t3.Браузер выбирает тот ресурс, ширина которого ближе всего к \n\tширине окна просмотра, и загружает его.\n\n\t4.Если подходящего ресурса не найдено, браузер загружает ресурс \n\tс указанным src атрибутом (если такой есть).\n\n\t5.Таким образом, SRCset позволяет создавать адаптивные изображения, \n\tкоторые автоматически изменяются в зависимости от размера окна браузера, \n\tулучшая опыт пользователя и оптимизируя загрузку ресурсов.\n"}, "nv": {"ques": "Как семантически верно сверстать навигационное меню", "result": "\n\t<nav>\n\t  <ul>\n\t    <li><a href=\"#\">Пункт меню 1</a></li>\n\t    <li><a href=\"#\">Пункт меню 2</a></li>\n\t    <li><a href=\"#\">Пункт меню 3</a></li>\n\t  </ul>\n\t</nav>\n"}, "fr": {"ques": "Что такое <iframe>", "result": "\n\tЕсли кратко, то iframe — это HTML-тег, который позволяет встроить \n\tодин документ в другой. Например, с его помощью можно вставить на \n\tсайт видео с YouTube или стороннюю веб-страницу.\n"}, "sb": {"ques": "Для чего используются тэги <sub> и <sup>", "result": "\n\tТэг <sub> используется для создания нижнего индекса (например, в химических формулах). \n\n\tТэг <sup> используется для создания верхнего индекса (например, степени или порядковые\n\t числительные).\n"}, "hd": {"ques": "Как можно скрыть элемент разметки не используя CSS и JS", "result": "\n\tМожно использовать атрибут hidden в HTML:\n\n\t<div hidden> скрытый элемент </div>\n"}, "mp": {"ques": "<meter> и <progress> html", "result": "\n\t-Тег <meter> используется для отображения относительного значения или состояния.\n\t-Тег <progress> используется для индикации прогресса выполнения задачи.\n\n\t<meter id=\"speedometer\" min=\"0\" max=\"100\" value=\"75\">\n  \t\t75%\n\t</meter>\n\n\t<progress max=\"100\">\n  \t\t<progress-bar style=\"width:20%;\" role=\"progressbar\" aria-valuenow=\"20\" \n  \t\taria-valuemin=\"0\" aria-valuemax=\"100\"></progress-bar>\n\t</progress>\n"}, "op": {"ques": "Как можно сгруппировать опции внутри тэга <select>", "result": "\n\t<select>\n\t  <optgroup label=\"Группа 1\">\n\t    <option value=\"1\">Опция 1</option>\n\t    <option value=\"2\">Опция 2</option>\n\t  </optgroup>\n\t  <optgroup label=\"Группа 2\">\n\t    <option value=\"3\">Опция 3</option>\n\t    <option value=\"4\">Опция 4</option>\n\t  </optgroup>\n\t</select>\n"}, "ek": {"ques": "Для чего используется атрибут enterkeyhint", "result": "\n\tАтрибут enterkeyhint позволяет менять вид и поведение кнопки Enter у \n\tвиртуальной клавиатуры мобильных устройств. Это позволяет изменить \n\tповедение полей формы и дать пользователю подсказку, что ему ожидать \n\tпри работе с клавиатурой.\n\n\t-enter - ожидается ввод текста.\n\t-done - ожидается завершение ввода.\n\t-next - ожидается переход к следующему полю ввода.\n\t-go - ожидается выполнение действия “перейти”.\n\t-search - ожидается запуск поиска.\n\t-send - ожидается отправка формы.\n\n\tЗначение по умолчанию зависит от браузера и операционной системы.\n"}, "nl": {"ques": " Для чего используют атрибут novalidate", "result": "\n\tАтрибут novalidate используется для отключения валидации формы по \n\tумолчанию. Валидация формы - это процесс проверки правильности введенных \n\tданных, чтобы убедиться, что они соответствуют требованиям. Отключение \n\tвалидации может быть полезно, если вы хотите создать форму, которая будет \n\tотправлять данные без проверки, или если вы хотите настроить свою собственную \n\tвалидацию.\n\n\t<form action=\"/action_page.php\" novalidate>\n\t\t  <label for=\"email\">Enter your email:</label>\n\t\t  <input type=\"email\" id=\"email\" name=\"email\"><br><br>\n\t\t  <input type=\"submit\">\n\t</form>\n"}, "im": {"ques": "Для чего используют атрибут inputmode", "result": "\n\tАтрибут inputmode говорит браузеру на устройствах с экранной клавиатурой какой набор \n\tсимволов показать при вводе данных в конкретное поле. Указывается для элементов \n\t<input> или <textarea>.\n\n\t<input type=\"text\" inputmode=\"numeric\">\n\n\t<textarea inputmode=\"text\"></textarea>\n\n\tВажно понимать разницу между атрибутом type и атрибутом inputmode:\n\n\t-атрибут inputmode только подсказывает браузеру, какой набор символов предложить \n\tпользователю для взаимодействия с полем ввода;\n\n\t-атрибут type устанавливает тип данных, которые пользователь может ввести \n\tв поле ввода.\n\n\tВид клавиатуры отличается в зависимости от локализации устройства, используемой \n\tоперационной системы или браузера.\n\n\t-text - обычный текст;\n\t-tel - номер телефона;\n\t-url - URL;\n\t-email - адрес электронной почты;\n\t-decimal - число с десятичной точкой;\n\t-search - поисковый запрос.\n"}, "pt": {"ques": " Для чего используется атрибут pattern", "result": "\n\tАтрибут pattern используется для определения регулярного выражения, \n\tкоторое будет использоваться для проверки введённого пользователем значения \n\tатрибуту data-pattern. Если значение не соответствует регулярному выражению, \n\tто значение считается недействительным.\n\n\t<input type=\"text\" id=\"fname\" name=\"fname\" pattern=\"[a-zA-Zа-яА-ЯёЁ]+\">\n\n\t<!-- здесь мы проверяем, состоит ли введённое значение из букв латинского и русского алфавита -->\n"}, "pf": {"ques": "Способы улучшения производительности веб-страницы при использовании HTML", "result": "\n\t-Минимизация HTML-кода: Удалите все ненужные пробелы, переносы строк и комментарии,\n\t которые не добавляют ценности вашему коду.\n\n\t-Правильный выбор элементов: Используйте только те элементы, которые действительно \n\tнеобходимы для вашего контента. Избегайте использования ненужных элементов, так как \n\tэто может увеличить размер и сложность вашего кода.\n\n\t-Кэширование ресурсов: Кэшируйте изображения, CSS и JavaScript файлы, чтобы уменьшить \n\tколичество HTTP-запросов и улучшить производительность вашей веб-страницы.\n\n\t-Сжатие ресурсов: Сжимайте CSS, JavaScript и HTML файлы для уменьшения их размера и \n\tускорения загрузки.\n\n\t-Оптимизация изображений: Используйте форматы изображений, которые поддерживают \n\tсжатие без потери качества (например, JPEG), а также оптимизируйте размеры и разрешение \n\tизображений для разных устройств и разрешений экрана.\n\n\t-Использование атрибута defer для внешних скриптов: Это позволяет браузеру загружать и \n\tвыполнять скрипт только тогда, когда это необходимо, что может уменьшить время загрузки страницы.\n\n\t-Использование асинхронной загрузки для внешних скриптов: Позволяет загружать скрипты \n\tпараллельно с загрузкой основного HTML-документа, что может ускорить загрузку страницы.\n\n\t-Ленивая подгрузка \n"}, "sa": {"ques": "Основные атрибуты HTML-форм? Как они влияют на отправку данных с веб-страницы", "result": "\n\tОсновные атрибуты HTML форм:\n\n\taction - определяет URL, на который будет отправлен запрос после отправки формы.\n\n\tmethod - указывает метод отправки данных (обычно GET или POST).\n\n\tenctype - указывает тип кодирования данных, отправляемых на сервер \n\t(обычно application/x-www-form-urlencoded или multipart/form-data).\n\n\ttarget - задает имя фрейма или окна, в которое будет загружаться результат отправки\n\tформы. Если этот атрибут не указан, то результат будет загружен в текущее окно.\n\n\taccept-charset - указывает кодировку символов, используемую для \n\tотправки данных формы.\n\n\tautocomplete - используется для управления автозаполнением полей \n\tформы (вкл./выкл.).\n\n\trequired - если этот атрибут присутствует, поле формы становится \n\tобязательным для заполнения.\n\n\tname - имя поля формы, которое используется для идентификации \n\tего на сервере.\n\n\tvalue - значение поля формы по умолчанию.\n\n\tmultiple - используется для множественного выбора в \n\tсписках и чекбоксах.\n\n\tdisabled - отключает поле формы.\n"}}