{"i": {"ques": "Основные принципы ООП", "result": "\n\t1.Инкапсуляция - сокрытие деталей реализации объекта, чтобы защитить его\n\tвнутреннее состояние от внешнего мира.\n\n\t2.Наследование - возможность создания новых классов на основе существующих, \n\tчто позволяет повторно использовать код.\n\n\t3.Полиморфизм - способность объектов с одинаковой интерфейсной частью \n\tвыполнять разные действия в зависимости от их типа.\n\n\t\tinterface Camera {\n\t\t    function takePicture();\n\t\t}\n\n\t\tclass MobilePhone implements Camera {\n\t\t    function takePicture() {\n\t\t        echo \"Taking photo with mobile phone\";\n\t\t    }\n\t\t}\n\n\t\tclass DSLR implements Camera {\n\t\t    function takePicture() {\n\t\t        echo \"Taking photo with DSLR\";\n\t\t    }\n\t\t}\n\n"}, "s": {"ques": "Что такое SOLID", "result": "\n\tSOLID - это аббревиатура, обозначающая пять основных принципов, которые следует соблюдать \n\tпри разработке объектно-ориентированных программ:\n\n\tS - принцип единственной обязанности (Single Responsibility Principle): каждый класс \n\tили модуль должен выполнять только одну конкретную обязанность.\n\n\tO - принцип открытости/закрытости (Open-Closed Principle): программы должны быть \n\tоткрыты для добавления нового функционала, но закрыты для изменений.\n\n\tL - принцип подстановки Барбары Лисков (Liskov Substitution Principle): объекты в \n\tпрограмме могут быть заменены на их подтипы без нарушения функциональности.\n\tЕсли у нас есть класс A (не виртуальный, а вполне реально используемый в коде) \n\tи отнаследованный от него класс B, то если мы заменим все использования класса A на B, \n\tничего не должно измениться в работе программы. Ведь класс B всего лишь расширяет \n\tфункционал класса A\n\n\tI - принцип разделения интерфейса (Interface Segregation Principle): интерфейсы должны \n\tбыть разделены на маленькие, специфические части.Это означает, что вместо создания одного \n\tбольшого интерфейса для всей системы, лучше создать несколько меньших интерфейсов, \n\tкаждый из которых выполняет одну определенную функцию.\n\tISP помогает уменьшить связанность между компонентами системы и упрощает тестирование \n\tи отладку, поскольку каждый интерфейс имеет свою четко определенную цель.\n\n\tD - принцип инверсии зависимости (Dependency Inversion Principle): модули верхних \n\tуровней не должны зависеть от модулей нижних уровней, а только указывать, что им нужно.\n\tЭто означает, что при проектировании системы следует создавать абстракции для высокоуровневых \n\tмодулей и реализовывать их на низком уровне. Таким образом, система становится более \n\tгибкой и легко изменяемой, поскольку изменения на высоком уровне не затрагивают \n\tнизкоуровневые компоненты и наоборот.\n"}, "p": {"ques": "Разница между классовым и прототипным наследованием", "result": "\n\tКлассовое наследование - это механизм, при котором дочерний класс наследует все методы и \n\tсвойства родительского класса. При создании объекта дочернего класса создается также объект \n\tродительского класса, и все изменения, сделанные в объекте дочернего класса, отражаются в \n\tобъекте родительского класса.\n\n\tПрототипное наследование, или наследование прототипов, - это механизм, который не создает \n\tиерархию классов, а позволяет добавлять свойства и методы к объектам на лету. При этом не \n\tсоздается новый класс, а просто добавляется новый метод или свойство к прототипу объекта. \n\tЭто делает код более гибким и легким для изменения.\n"}, "d": {"ques": "Однонаправленный поток данных и двусторонняя связь данных", "result": "\n\tОднонаправленный поток данных означает, что данные передаются в одном направлении. \n\tНапример, из веб-сервера в браузер. В этом случае данные идут только в одном \n\tнаправлении - от сервера к клиенту.\n\n\tДвунаправленная связь данных означает, что данные могут передаваться в двух направлениях. \n\tНапример, между клиентом и сервером. В этом случае данные могут идти как от сервера к \n\tклиенту, так и от клиента к серверу.\n"}, "m": {"ques": "Что такое MVC", "result": "\n\tMVC (Model-View-Controller) - это архитектурный паттерн, который разделяет приложение \n\tна три основных компонента: модель, представление и контроллер.\n\n\t-Модель представляет собой слой, который отвечает за работу с данными и бизнес-логикой. \n\tОна содержит объекты, которые представляют данные, и методы для работы с этими данными.\n\n\t-Представление (View) - это интерфейс пользователя, который отображает информацию, \n\tполученную от модели. Он может быть представлен в виде HTML-страницы, мобильного приложения \n\tили любого другого типа интерфейса.\n\n\t-Контроллер (Controller) - это промежуточный слой между моделью и представлением. \n\tОн отвечает за обработку пользовательского ввода, обновление модели и обновление \n\tпредставления в соответствии с изменениями в модели.\n\n\tMVC позволяет разделить приложение на логические блоки, что облегчает его разработку, \n\tтестирование и поддержку.\n"}, "k": {"ques": "Что такое каррирование (Currying)", "result": "\n\tКаррирование - это процесс “разворачивания” функции с несколькими аргументами в \n\tцепочку функций с одним аргументом.\n\n\tНапример, у нас есть функция multiply которая принимает два аргумента:\n\n\tconst multiply = (a, b) => a * b;\n\n\tМы можем развернуть эту функцию в цепочку из двух функций с одним аргументом, используя каррирование:\n\n\tconst curriedMultiply = a => b => a * b;\n\tconst result = curriedMultiply(2)(3); // result == 6`\n"}, "t": {"ques": "Статический метод класса (static)", "result": "\n\tСтатический метод класса может быть вызван без создания экземпляра класса. Он принадлежит \n\tсамому классу, а не конкретному экземпляру класса. Статические методы обычно используются\n\tдля работы с общими ресурсами или для выполнения операций, которые не зависят от \n\tконкретного экземпляра класса.\n\n\tВызов статического метода осуществляется с использованием ключевого слова static и имени \n\tметода в качестве аргумента. Например:\n\n\tMyClass.staticMethod();\n"}, "n": {"ques": "Типы паттернов в ООП", "result": "\n\tПаттерны в ООП можно разделить на несколько категорий:\n\n\t-Порождающие паттерны: Эти паттерны используются для создания объектов. Они включают \n\tв себя паттерны Builder, Factory Method, Abstract Factory, Prototype и Singleton.\n\n\t-Структурные паттерны: Структурные паттерны определяют, как объекты связаны друг с другом. \n\tПримеры структурных паттернов включают Adapter, Bridge, Composite, Decorator, Facade и Proxy.\n\n\t-Поведенческие паттерны: Поведенческие паттерны описывают, как взаимодействуют объекты. Примеры \n\tповеденческих паттернов включают Chain of Responsibility, Command, Interpreter, Iterator, Mediator, \n\tMemento, Observer, State и Strategy.\n\n\t-Паттерны параллельного программирования: Эти паттерны помогают управлять параллелизмом \n\tв приложениях. Некоторые из них включают в себя Active Object, Basic Threading, Dataflow, \n\tEvent-Driven, Guarded Suspension, Pipes and Filters, Reactor и Thread Pool.\n"}, "v": {"ques": "Как работает механизм прототипов в JavaScript", "result": "\n\tМеханизм прототипов в JavaScript работает путем наследования свойств и методов от \n\tпрототипов. Каждый объект в JavaScript имеет свой прототип, который определяет его \n\tповедение и характеристики. Когда вы создаете новый объект, он получает свойства и \n\tметоды от своего прототипа. Если объект не имеет определенного свойства или метода, \n\tто JavaScript ищет это свойство или метод в прототипе объекта и, если не находит, \n\tто продолжает искать в прототипах родительских объектов, пока не найдет или не дойдет \n\tдо самого первого прототипа, Object.prototype. Если свойство или метод не найден ни \n\tв одном из прототипов, то генерируется ошибка. Таким образом, механизм прототипов \n\tпозволяет JavaScript объектам наследовать свойства и поведение без использования \n\tклассической системы наследования классов.\n\n\t1. __proto__ есть у КАЖДОГО объекта(в том числе class, function и примитива(boxing))\n\t2. prototype существует ТОЛЬКО у класса(class) или function(Declaration), но не у \n\t   примитивов и объектов\n\n\t\tт.к. __proto__ есть у каждого объекта и __proto__ ссылается на prototype класса, то:\n\t\tconst obj = {name: 'ivan'};\n\t\tconst arr = [4, 6, 4];\n\n\t\tobj.__proto__ === Object.prototype // true\n\t\tarr.__proto__ === Array.prototype // true\n\n\t\tно т.к. prototype существует только у class и function(Declaration), то:\n\n\t\tconst obj = {name: 'ivan'};\n\t\tobj.prototype // undefined\n\n\t3. __proto__ ссылается на prototype конструктора(класса) благодаря которому был создан\n\n\t\tconst f = function() {}\n\t\tconst str = \"this is string\";\n\n\t\tf.__proto__ === Function.prototype   // true\n\t\tstr.__proto__ === Function.prototype   // false\n\n\t4. __proto__ одного по типу объекта равны, но разные по типу объекты имеют разный __proto__\n\n\t\tconst num = 55;\n\t\tconst nub2 = 953;\n\n\t\tconst str = \"i'm string\"\n\n\t\tnum.__proto__ === num2.__proto__   // true\n\t\tnum.__proto__ === str.__proto__   // false\n\n\t5. Каждый prototype это независимый объект который содержит в себе методы, присущие\n\t   определенному классу\n\n\t   Когда мы обращаемся к методу которого нет в объекте:\n\n\t   const obj = {name: \"victor\"};\n\t   obj.toString() // toString не существует в obj, поэтому:\n\t   obj.__proto__ -> Object.prototype.toString\n\n\t6. У каждого function и class имеется свой собственный prototype\n\n\t\tconst f1 = function() {}\n\t\tconst f2 = function() {}\n\n\t\tf1.prototype === f2.prototype  // false\n\n\t7. У стрелочной функции нет prototype( __proto__ есть )\n"}, "x": {"ques": "Разница между императивным и декларативным подходами программирования", "result": "\n\tИмперативное программирование предполагает описание последовательности действий \n\tдля решения задачи. Это означает, что вы должны явно указывать, какие операции нужно \n\tвыполнить и в каком порядке. Императивное программирование обычно использует циклы, \n\tусловные операторы и другие конструкции для управления потоком выполнения программы.\n\n\tДекларативное программирование, с другой стороны, описывает задачу в терминах того, \n\tчто должно быть достигнуто, а не как это должно быть сделано. В декларативном программировании \n\tвы определяете данные и правила, которым они должны удовлетворять, и программа автоматически \n\tгенерирует последовательность операций для достижения желаемого результата. Декларативное \n\tпрограммирование часто использует логические и математические выражения для описания задачи, \n\tа также языки запросов и правил.\n\n\tИмперативное программирование может быть более подходящим для решения задач, которые требуют \n\tвыполнения последовательности операций, таких как обработка данных или управление устройствами. \n\tДекларативное программирование лучше подходит для задач, где важнее описать, что нужно получить, \n\tа не как этого достичь, например, в системах баз данных или веб-приложениях.\n"}, "r": {"ques": "Что такое реактивное программирование", "result": "\n\tРеактивное программирование (reactive programming) — это подход к разработке программного \n\tобеспечения, который фокусируется на обработке потоков данных в реальном времени. Этот \n\tподход используется для создания систем, которые могут быстро реагировать на изменения \n\tв данных и адаптироваться к ним.\n\n\tВ реактивном программировании используются так называемые реактивные библиотеки, которые \n\tпозволяют обрабатывать данные в режиме реального времени без необходимости постоянного \n\tобновления состояния системы. Это делает реактивное программирование идеальным для \n\tсоздания масштабируемых и высокопроизводительных систем.\n"}, "e": {"ques": "Разница между агрегацией и композицией", "result": "\n\tОба эти понятия относятся к принципам объектно-ориентированного проектирования, \n\tно они имеют разные значения.\n\n\tАгрегация - это связь между объектами, при которой один объект (агрегат) включает в \n\tсебя другие объекты (части), но части не имеют прямой ссылки на агрегат. Агрегация \n\tобычно используется для моделирования отношений “имеет” или “включает в себя”. Например, \n\tавтомобиль имеет колеса, двери и т.д.\n\n\tКомпозиция - это более сильная форма агрегации, при которой части имеют прямую ссылку \n\tна агрегат и могут быть доступны через него. Композиция обычно используется для \n\tмоделирования более сильных связей между объектами, когда части являются неотъемлемой \n\tчастью целого. Например, человек имеет руки и ноги, которые являются его частями и \n\tне могут существовать отдельно от него.\n"}}