{"i": {"ques": "Что такое React?", "result": "\n\tReact - это библиотека JavaScript, которая используется\n\tдля создания пользовательских интерфейсов. Она была \n\tсоздана компанией Facebook и стала очень популярной \n\tсреди разработчиков. React позволяет создавать компоненты\n\tинтерфейса, которые могут быть использованы многократно.\n\tЭто ускоряет процесс разработки и делает код более \n\tорганизованным.\n"}, "h": {"ques": "Особенности React", "result": "\n\t-React использует виртуальное DOM-дерево для оптимизации\n\t производительности.\n\n\t-React позволяет создавать повторно используемые компоненты,\n\t что упрощает разработку и улучшает читаемость кода.\n\n\t-React поддерживает состояние и пропсы для управления\n\t данными.\n\n\t-React имеет встроенный инструмент для тестирования - Jest.\n\n\t-React интегрируется с другими инструментами и фреймворками,\n\t такими как Redux, React Router и Material-UI.\n\n\t-React может использоваться как на стороне клиента \n\t(в браузере), так и на стороне сервера (с помощью React \n\tServer Side Rendering).\n"}, "r": {"ques": "Что такое Virtual DOM", "result": "\n\t-Virtual DOM (Virtual Document Object Model) - это \n\tвиртуальный аналог настоящего DOM-дерева, используемый в\n\tReact для улучшения производительности приложения. \n\tВиртуальный DOM позволяет быстро и эффективно обновить \n\tпользовательский интерфейс без необходимости полной \n\tперерисовки всей страницы.\n\n\t-Работа Virtual DOM основана на том, что при изменении\n\tданных в приложении React создаёт новый виртуальный DOM,\n\tсравнивает его с предыдущим виртуальным DOM и находит только\n\tте элементы, которые реально были изменены. После этого \n\tReact обновляет настоящий DOM только для изменённых элементов,\n\tчто существенно ускоряет процесс обновления \n\tпользовательского интерфейса.\n"}, "k": {"ques": "Атрибут key при рендере?", "result": "\n\tАтрибут key используется React при определении порядка \n\tрендеринга элементов в списке. Если у элементов списка \n\tнет уникального ключа, React не сможет определить порядок \n\tрендеринга и может возникнуть ошибка или неожиданные результаты.\n\n\tПри использовании ключей React может определить порядок \n\tрендеринга, гарантируя тем самым корректную работу вашего \n\tприложения. Ключи должны быть уникальными для каждого \n\tэлемента списка, и рекомендуется использовать значения, \n\tкоторые однозначно идентифицируют каждый элемент.\n"}, "p": {"ques": "PureComponent", "result": "\n\tКласс React.PureComponent позволяет создавать на его \n\tоснове компоненты также, как и класс React.Component,\n\tоднако они имеют одно важное различие.\n\n\tВ React.PureComponent реализован метод жизненного цикла\n\tshouldComponentUpdate(), отвечающий за проверку, нужно \n\tли производить перерисовку компонента или нет. Он производит\n\tповерхностное сравнение пропов и состояния компонента с \n\tпредыдущими, чтобы понять, изменились ли они, и перерисовка\n\tпроисходит только в случае нахождения различий.\n\n\tВ React.Component перерисовка происходит всегда, так как\n\tподобная проверка отсутствует. Однако при желании \n\tее может реализовать программист.\n"}, "c": {"ques": "Higher-Order Component / HOC", "result": "\n\tКомпонент высшего порядка - это функция, которая принимает \n\tкомпонент в качестве аргумента и возвращает другой компонент.\n\tHOC позволяет расширять функциональность компонента без изменения\n\tего исходного кода. Например, можно создать HOC, который добавляет\n\tавторизацию к компоненту, не изменяя сам компонент.\n"}, "q": {"ques": "Жизненный цикл компонентов React", "result": "\n\t1.Инициализация\n\t2.Монтирование\n\t3.Обновление\n\t4.Размонтирование\n"}, "t": {"ques": "Что такое Portal", "result": "\n\tПорталы - это способ визуализации элемента в узле DOM, \n\tкоторый существует вне иерархии DOM родительского компонента.\n\tЭто полезно для компонентов таких как модальные окна, тултипы, и др\n\n\tReactDOM.createPortal(элемент который, элемент куда) \n\tcreatePortal(children, domNode, key?)\n\n\timport { createPortal } from 'react-dom';\n\n\t// ...\n\n\t<div>\n\t  \t<p>This child is placed in the parent div.</p>\n\t  \t\t{createPortal(\n\t    <p>This child is placed in the document body.</p>,\n\t    document.body\n\t  )}\n\t</div>oop.py\n"}, "b": {"ques": "Что такое React хуки", "result": "\n\tReact Hooks – это механизм, позволяющий использовать состояние\n\tи некоторые другие возможности React внутри функциональных \n\tкомпонентов, не прибегая к классам. Они были представлены в React\n\t16.8 и позволяют упростить и улучшить код компонентов.\n\n\tС помощью Hooks можно работать с состоянием, использовать эффекты\n\t(например, обработку жизненного цикла компонента или асинхронные\n\tоперации), а также применять другие функции React. При этом Hooks\n\tне заменяют полностью классы, а лишь упрощают их использование.\n"}, "j": {"ques": "Что Такое JSX?", "result": "\n\tJSX — это язык разметки, который используется для создания \n\tпользовательских интерфейсов (UI) на основе HTML. Он является \n\tрасширением языка JavaScript и позволяет создавать элементы HTML, \n\tтакие как div, span, input и др., прямо в коде JavaScript. JSX \n\tтакже позволяет определять стили CSS и обрабатывать события \n\tJavaScript внутри одного файла.\n"}, "s": {"ques": "Разница между состоянием(state) и пропсами(props)?", "result": "\n\tСостояние (state) компонента - это внутренняя переменная, которая\n\tхранит данные компонента. Состояние изменяется при выполнении \n\tопределенных действий, например, при нажатии на кнопку.\n\n\tПропсы (props) - это входные данные, которые передаются компоненту \n\tот родительского компонента. Пропсы используются для передачи данных \n\tмежду компонентами и не могут быть изменены внутри компонента.\n\n\tОсновное различие между состоянием и пропсами заключается в том, \n\tчто состояние изменяется внутри компонента, в то время как пропсы \n\tпередаются извне и не могут быть изменены.\n"}, "f": {"ques": "Что такое React Fiber", "result": "\n\tReact Fiber - это новая система рендеринга React, представленная\n\tв React 16.6, которая предназначена для улучшения производительности\n\tприложений React. Fiber использует асинхронную модель рендеринга,\n\tгде компоненты могут рендериться параллельно, что позволяет улучшить\n\tпроизводительность и уменьшить время загрузки страниц.\n\n\tFiber также предоставляет возможность управления приоритетами \n\tрендеринга компонентов, что позволяет приложениям React лучше \n\tиспользовать ресурсы браузера и оптимизировать производительность. \n\tКроме того, Fiber поддерживает разделение кода на несколько потоков, \n\tчто может снизить нагрузку на основной поток и улучшить \n\tпроизводительность приложения в целом.\n"}, "y": {"ques": "Синтетические события в react", "result": "\n\tСинтетические события в React — это механизм, который позволяет\n\tкомпонентам обрабатывать пользовательские события, такие как клики,\n\tизменения форм и т. д. Это позволяет улучшить производительность\n\tи гибкость приложения.\n\n\tСинтетические события отличаются от обычных тем, что они \n\tобрабатываются на уровне компонентов в React, а не на уровне DOM. \n\tЭто позволяет упростить обработку событий и сделать код более модульным. \n\tКроме того, синтетические события позволяют использовать хуки, что \n\tделает код еще более читаемым и удобным для разработки.\n"}, "m": {"ques": "Что такое компонент-переключатель (Switching Component)", "result": "\n\tКомпонент-переключатель в React используется для отображения или \n\tскрытия другого компонента в зависимости от определенного условия. \n\tОн принимает условие в качестве параметра и возвращает один из \n\tдвух компонентов: либо первый компонент, либо второй.\n"}, "d": {"ques": "Что такое React DOM", "result": "\n\tReact DOM - это библиотека, которая позволяет отображать react \n\tкомпоненты на странице. Она взаимодействует с браузером и рендерит \n\tкомпоненты на страницу. React DOM используется вместе с React, чтобы\n\tсоздавать интерактивные и динамические веб-страницы.\n"}, "z": {"ques": "Разница между компонентом и контейнером React", "result": "\n\tКомпонент - это минимальная функциональная единица приложения React,\n\tкоторая может состоять из текста, изображений, форм и других элементов.\n\tКомпоненты используются для создания пользовательского интерфейса приложения.\n\n\tКонтейнеры - это также компоненты, но они используются для управления \n\tсостоянием и данными в приложении. Они отвечают за обработку данных, \n\tпоступающих от пользователей, и отправку их на сервер. Контейнеры также \n\tмогут управлять состоянием компонентов и обновлять их при изменении данных.\n\n\tКОНТЕЙНЕР - ВЫПОЛНЯЕТ БИЗНЕС-ЛОГИКУ(ПОЛУЧЕНИЕ ДАННЫХ И Т.Д) И ПЕРЕДАЕТ ЕЕ В КОМПОНЕНТ\n\tКОМПОНЕНТ - ВЫПОЛНЯЕТ ОТРИСОВКУ ДАННЫХ\n\n\tНиже приведены некоторые причины, по которым нам требуются контейнерные и \n\tпрезентационные компоненты:\n\t\t-Они помогают нам создавать слабосвязанные компоненты.\n\t\t-Они помогают нам поддерживать разделение ответственности.\n\t\t-Рефакторинг кода становится намного проще.\n\t\t-Код становится более организованным и удобным в сопровождении\n\t\t-Это значительно упрощает тестирование.\n"}, "n": {"ques": "Что такое «опрос» (Polling)", "result": "\n\tОпрос (polling) - это метод, при котором клиент периодически \n\tзапрашивает сервер на наличие новых данных. В React это можно \n\tреализовать с помощью компонента, который будет периодически \n\tотправлять запрос на сервер для получения новых данных. Для \n\tэтого можно использовать библиотеку axios или fetch.\n\n\tcomponentDidUpdate() {\n    \tsetTimeout(this.fetchData, 5000); \n  \t}\n\n  \trender() {\n    \tif (this.state.data === null) {\n      \t\treturn <div>Загрузка...</div>;\n      \t}\n    }\n"}, "u": {"ques": "ReactDOMServer", "result": "\n\tReactDOMServer — это модуль в React, который позволяет \n\tработать с HTML на стороне сервера. Он используется для \n\tсоздания и управления HTML-разметкой на сервере, что может \n\tбыть полезно при создании статических сайтов или при \n\tрендеринге React-компонентов на сервере.\n"}, "e": {"ques": "Что такое предохранители (Error Boundaries)", "result": "\n\tПредохранители (Error Boundaries) - это специальные компоненты\n\tв React, которые позволяют обрабатывать ошибки, возникающие\n\tв дочерних компонентах. Они помогают предотвратить падение\n\tвсего приложения, если один из компонентов выдает ошибку. \n\tПредохранители могут показать пользователю уведомление об \n\tошибке или скрыть проблемный компонент\n"}, "2": {"ques": "Разница между рендерингом и монтированием", "result": "\n\t-Рендеринг — это процесс преобразования данных компонента в\n\tHTML-код. В React рендеринг происходит на основе состояния \n\tкомпонента и его пропсов (свойств). В результате рендеринга \n\tсоздается виртуальный DOM (Document Object Model), который \n\tпредставляет собой структуру HTML-элементов.\n\n\t-Монтирование — это процесс вставки компонента в DOM. После \n\tтого, как компонент отрендерен, React вставляет его в DOM. \n\tПри этом React следит за изменениями состояния компонента \n\tи обновляет его отображение в DOM при необходимости.\n"}, "5": {"ques": "сhildren", "result": "\n\tChildren в React - это элементы, которые передаются в компонент\n\tв качестве дочерних элементов. Они могут быть любого типа: \n\tстроки, числа, другие компоненты и т. д. Children используются\n\tдля создания вложенных компонентов и для передачи данных между ними.\n"}, "po": {"ques": "События указателя (Pointer Events)", "result": "\n\tСобытия указателя в React - это события, которые возникают \n\tпри взаимодействии пользователя с указателем, таким как мышь \n\tили сенсорный экран. Они используются для обработки действий \n\tпользователя, таких как нажатия, движения мыши и жесты.\n"}, "a": {"ques": "Инверсия наследования (Inheritance Inversion)", "result": "\n\tИнверсия наследования в React - это принцип, согласно которому \n\tкомпоненты должны принимать свойства и состояния от своих родителей,\n\tа не передавать их вниз по дереву компонентов. Это помогает \n\tсохранить структуру приложения простой и понятной, а также \n\tоблегчает изменение и расширение компонентов в будущем\n"}, "de": {"ques": "Разница между классовым и функциональным компонентами", "result": "\n\tКлассовые компоненты предоставляют дополнительные возможности,\n\tтакие как состояние и методы жизненного цикла, которых нет в функциональных\n\tкомпонентах. Функциональные компоненты, как правило, проще \n\tи используются для более простых задач.\n\tФункциональные компоненты обычно работают быстрее, чем классовые компоненты, \n\tпотому что они имеют меньше накладных расходов и не создают экземпляры классов.\n"}, "w": {"ques": " Разница между useEffect() и componentDidMount()", "result": "\n\tuseEffect в React используется для выполнения кода после \n\tмонтирования компонента или после изменения его пропов. \n\tОн также может использоваться для очистки ресурсов, когда \n\tкомпонент размонтируется. componentDidMount - это метод жизненного\n\tцикла компонента, который выполняется только один раз после монтирования \n\tкомпонента. Он не может использоваться для очистки ресурсов \n\tпри размонтировании компонента.\n"}, "hp": {"ques": "Преимущества хуков", "result": "\n\t-Хуки в React предоставляют несколько преимуществ:\n\n\t-Хуки позволяют использовать состояние и другие функции React в \n\tфункциональных компоненрах, что делает их более гибкими и простыми в \n\tиспользовании.\n\n\t-Хуки улучшают производительность, так как они не создают новые \n\tэкземпляры классов для каждого рендера компонента.\n\n\t-Хуки упрощают код, так как не нужно создавать новый класс для \n\tкаждого компонента, и можно использовать один и тот же хук для \n\tразных компонентов.\n\n\t-Хуки делают код более читаемым и понятным, так как каждый хук \n\tвыполняет одну конкретную задачу.\n"}, "l": {"ques": "Lifting State Up", "result": "\n\tПоднятие состояния вверх (lifting state up) – это принцип \n\tорганизации структуры компонента в React, при котором состояние \n\tвыносится на уровень ближайшего родительского компонента, \n\tкоторый владеет данными, необходимыми для работы этого состояния. \n\tЭто позволяет улучшить структуру компонента, уменьшить его \n\tсложность и улучшить его повторное использование\n"}, "su": {"ques": "Что делает метод shouldComponentUpdate", "result": "\n\tМетод shouldComponentUpdate в React определяет, нужно \n\tли обновлять компонент при следующем рендере. Он принимает \n\tпропсы и состояние компонента и возвращает true или false. \n\tЕсли метод возвращает false, компонент не будет обновляться \n\tпри следующем рендере, что может повысить производительность \n\tприложения.\n"}, "fi": {"ques": "Как реализовать однократное выполнение операции при начальном рендеринге?", "result": "\n\tДля выполнения операции только один раз при первоначальном \n\tрендере компонента можно использовать useRef:\n\n\timport { useRef } from 'react';\n\n\tfunction Component() {\n  \t\tconst initialRender = useRef(true);\n  \t\tif (initialRender.current) {\n    \t\tinitialRender.current = false;\n    \t\t// Здесь выполняем операцию\n  \t}\n\n  \t\treturn <div>Component</div>;\n\t}\n"}, "uu": {"ques": "useImperativeHandle(), useLayoutEffect()", "result": "\n\t-useImperativeHandle - этот хук используется для предоставления \n\tдоступа к методам и свойствам компонента из родительского компонента. \n\tЭто может быть полезно, например, для доступа к данным формы \n\tиз родительского компонента.\n\n\t-useLayoutEffect - этот хук вызывается после того, как компонент \n\tотрисован, но до того, как он отображается на экране. Он может \n\tиспользоваться для выполнения операций, которые должны произойти \n\tпосле того, как компонент отрисован, например для анимации.\n"}, "o": {"ques": "Что такое реактивность", "result": "\n\tРеактивность — это свойство системы автоматически реагировать \n\tна изменения во внешней среде. В программировании реактивными \n\tмогут быть библиотеки, языки программирования и фреймворки.\n\n\tReact — это библиотека для создания пользовательских интерфейсов.\n\tОна не является реактивной в том смысле, что она не \n\tотслеживает автоматически изменения в данных и не обновляет \n\tинтерфейс. Однако, React предоставляет инструменты для \n\tуправления состоянием и изменениями в состоянии компонентов, \n\tчто позволяет разработчикам создавать интерактивные \n\tи динамические интерфейсы.\n"}, "sf": {"ques": "Лучшие практики безопасности в React", "result": "\n\t-Использование библиотек: Используйте известные и проверенные \n\tбиблиотеки, такие как React Router, Redux, Material UI и т.д. \n\tЭто помогает предотвратить уязвимости, связанные с неправильной \n\tконфигурацией и использованием компонентов.\n\n\t-Структурирование кода: Обеспечьте четкое разделение компонентов \n\tна разные папки или файлы, чтобы предотвратить неправильное \n\tиспользование или вмешательство компонентов друг в друга.\n\n\t-Валидация входных данных: Убедитесь, что все входные данные \n\tпроходят проверку на корректность и безопасность, прежде \n\tчем они будут использоваться в приложении.\n\n\t-Изоляция состояния: Разделяйте состояние компонентов, чтобы \n\tпредотвратить утечки данных и проблемы с синхронизацией.\n\n\t-Защита от XSS атак: Используйте безопасные шаблоны, такие \n\tкак Helmet, для предотвращения XSS атак.\n\n\t-Защита CSRF атак: Применяйте CSRF токены для предотвращения \n\tCSRF атак.\n\n\t-Безопасное хранение данных: Используйте надежные алгоритмы \n\tшифрования и хеширования для хранения и передачи чувствительных данных.\n\n\t-Тестирование безопасности: Регулярно проводите тестирование на \n\tпроникновение и анализ уязвимостей, чтобы выявить и исправить \n\tпотенциальные проблемы безопасности.\n\n\t-Управление обновлениями: Обновляйте компоненты и библиотеки \n\tсвоевременно для предотвращения использования уязвимостей в коде.\n"}, "rx": {"ques": "Что такое Redux? Ключевые принципы Redux", "result": "\n\tRedux — это популярная JavaScript-библиотека для управления состоянием веб-приложений. \n\tОсновными принципами Redux являются:\n\n\t-Единственность источника правды: В Redux есть единственное хранилище состояния, \n\tв котором содержатся все данные приложения, что упрощает код и предотвращает \n\tконфликты между разными источниками данных.\n\n\t-Изменение состояния с помощью чистых функций: Для изменения состояния используются \n\tфункции, которые не должны иметь побочных эффектов, должны быть детерминированными \n\tи не должны зависеть от предыдущих вызовов.\n\n\t-Организованное управление действиями: Redux предоставляет механизм для определения \n\tи передачи действий между компонентами приложения, упрощая код и делая его более понятным.\n"}, "rc": {"ques": "Ключевые концепции Redux", "result": "\n\t1.Единое состояние: В Redux имеется единственное централизованное хранилище \n\tсостояния, содержащее всю информацию о состоянии приложения.\n\n\t2.Чистые функции: Изменение состояния осуществляется с помощью функций, которые \n\tдолжны быть чистыми, то есть не иметь побочных эффектов, быть детерминированными \n\t(всегда возвращать одинаковый результат при одинаковых входных данных) и не \n\tзависеть от предыдущих вызовов\n\n\t3.Действия: В Redux предусмотрен механизм для описания изменений состояния (действий), \n\tкоторый позволяет структурировать код и упрощает отладку.\n\n\t4.Редьюсеры: Редьюсеры — это функции, которые принимают состояние и действие и возвращают \n\tновое состояние. Они используются для обновления состояния на основе полученных действий\n\n\t5.store: Магазин представляет собой обертку над состоянием и редьюсерами, которая \n\tобеспечивает интерфейс для управления состоянием. Он отвечает за обработку действий, \n\tвызов редьюсеров и обновление состояния.\n"}, "ss": {"ques": "Что такое «единственный источник истины» (Single Source of Truth)", "result": "\n\tЕдинственный источник истины” (Single Source of Truth, SST) - это принцип, \n\tкоторый гласит, что все данные должны храниться в одном централизованном месте. \n\tЭто позволяет избежать дублирования данных и обеспечивает согласованность информации \n\tв системе. SST обычно реализуется с помощью систем управления состоянием, \n\tтаких как Redux или Flux.\n"}, "rd": {"ques": "Что такое редьюсер (Reducer)", "result": "\n\tРедьюсер (reducer) - это функция в Redux, которая принимает состояние и действие \n\t(действие - это изменение состояния) и возвращает новое состояние. Редьюсеры используются \n\tдля обновления состояния приложения на основе полученных действий.\n\n\timport { createSlice } from \"@reduxjs/toolkit\";\n\n\t\tconst initialState = {\n\t\t  count: 0,\n\t\t};\n\n\t\texport const counterSlice = createSlice({\n\t\t  name: \"counter\",\n\t\t  initialState,\n\t\t  reducers: {\n\t\t    increment: (state) => {\n\t\t      state.count++;\n\t\t    },\n\t\t    decrement: (state) => {\n\t\t      if (state.count > 0) {\n\t\t        state.count--;\n\t\t      }\n\t\t    },\n\t\t  },\n\t\t});\n\n\t\texport const { increment, decrement } = counterSlice.actions;\n\n\t\texport default counterSlice.reducer;\n"}, "st": {"ques": "Разница между React State и Redux State", "result": "\n\tReact state существует только на уровне одного компонента и используется для \n\tхранения данных, которые изменяются внутри этого компонента. React state \n\tпринадлежит самому компоненту и не может быть напрямую изменено другими компонентами.\n\n\tRedux state, с другой стороны, существует на уровне всего приложения и может \n\tбыть изменено и использовано любыми компонентами этого приложения. Redux state \n\tобычно используется для координации взаимодействия между различными компонентами \n\tи обеспечения согласованности данных в приложении.\n"}, "rp": {"ques": "Как выглядит поток данных в Redux-приложении", "result": "\n\t1.Пользователь взаимодействует с компонентом.\n\t2.Компонент отправляет действие в хранилище состояния.\n\t3.Редьюсер обрабатывает действие и обновляет хранилище состояния.\n\t4.Хранилище состояния отправляет новые данные обратно в компонент через пропсы.\n\t5.Компонент обновляет свое представление на основе новых данных.\n"}}