{"i": {"ques": "Что такое TypeScript", "result": "\n\tTypeScript - это язык программирования, разработанный компанией Microsoft.\n\tОн является надмножеством языка JavaScript и добавляет к нему статическую \n\tтипизацию, конструкции, упрощающие написание кода, и другие возможности. \n\tTypeScript программы можно скомпилировать в обычный JavaScript, который \n\tможет быть выполнен в браузере или на сервере. Это позволяет использовать \n\tпреимущества TypeScript, не требуя изменений в коде, который использует \n\tJavaScript.\n"}, "s": {"ques": "Назовите особенности TypeScript", "result": "\n\t-Статическая типизация. TypeScript обеспечивает строгую проверку типов на \n\tэтапе компиляции. Это помогает находить ошибки в коде до его выполнения.\n\n\t-Generics. Generics позволяют создать обобщенный код, который работает с различными \n\tтипами данных без необходимости создавать отдельные версии функции для каждого типа.\n\n\t-Interfaces. TypeScript поддерживает интерфейсы, которые позволяют определить \n\tабстрактный тип данных и использовать его в коде.\n\n\t-Modules. TypeScript поддерживает модули, что позволяет разбивать код на \n\tотдельные блоки и управлять зависимостями между ними.\n\n\t-Type inference. TypeScript может автоматически выводить типы переменных и \n\tпараметров функции на основе их значений.\n\n\t-Type guards. Type guards позволяют проверить тип переменной во время выполнения \n\tкода и выполнить разные блоки кода в зависимости от типа переменной.\n\n\t-Mapped types. Mapped types позволяют создавать новый тип на основе существующего, \n\tизменяя его свойства или добавляя новые свойства.\n\n\t-Conditional types. Conditional types позволяют создать тип, который зависит от \n\tусловия, например от значения другой переменной или от результата выражения.\n\n\t-Union and intersection types. Union и intersection types позволяют объединять \n\tили пересекать несколько типов, чтобы создать новый тип.\n"}, "p": {"ques": "Плюсы использования TypeScript?", "result": "\n\t-Более строгий контроль типов.\n\t-Более читаемый код.\n\t-Совместимость с JavaScript.\n\t-Поддерживается многими инструментами.\n\t-Может улучшить производительность.\n"}, "t": {"ques": "Типы в TypeScript?", "result": "\n\tTypeScript поддерживает различные типы данных, включая:\n\n\t-Строки (string)\n\t-Числа (number)\n\t-Логические значения (boolean)\n\t-Объекты (object)\n\t-Массивы (array)\n\t-Перечисления (enum)\n\t-Псевдонимы типов (type aliases)\n\t-Интерфейсы (interfaces)\n\t-Классы (classes)\n\t-Обобщенные типы (generics)\n"}, "d": {"ques": "Декораторы", "result": "\n\tTypeScript поддерживает различные типы данных, включая:\n\t\n\tДекораторы в TypeScript позволяют добавлять дополнительные метаданные к \n\tклассам, методам, свойствам и параметрам. Они позволяют изменять поведение \n\tкласса, метода, свойства или параметра без необходимости изменения исходного \n\tкода. Например, декоратор может использоваться для добавления логирования или \n\tдля изменения поведения метода при определенных условиях.\n"}, "f": {"ques": "Что такое перегрузка функций", "result": "\n\tПерегрузка функций - это возможность определить несколько функций с одним \n\tи тем же именем, но с разными наборами параметров и возвращаемыми типами. \n\tВ этом случае, выбор конкретной функции осуществляется на основе типов \n\tаргументов, передаваемых при вызове функции.\n\n\tfunction print(value: string): void;\n\tfunction print(value: number): void;\n\tfunction print(value: any): void {\n\t    console.log(value);\n\t}\n\n\tprint(\"Hello, World!\"); // Выведет \"Hello, World!\"\n\tprint(42); // Выведет 42\n\tprint(true); // Выведет true\n\n\tВ этом примере определены три функции print с разной сигнатурой, но все они \n\tпринимают один аргумент и не возвращают значение. Когда вызывается функция print, \n\tTypeScript выбирает наиболее подходящую из перегруженных функций на основе \n\tтипа аргумента.\n"}, "r": {"ques": "Поддерживает ли TypeScript перегрузку функций", "result": "\n\tДа, TypeScript поддерживает перегрузку функций. Вы можете определить несколько \n\tфункций с одним и тем же именем, но с разными наборами параметров. TypeScript \n\tбудет выбирать наиболее подходящую функцию на основе типов аргументов.\n"}, "o": {"ques": "Разница между type и  interface в typescript", "result": "\n\tТипы в TypeScript более гибкие и могут определять примитивы, пересечения, \n\tобъединения, кортежи или различные типы данных, а интерфейсы используются \n\tдля описания формы объекта. Типы используют ключевое слово type для создания \n\tнового типа, а интерфейсы — ключевое слово interface для объявления интерфейса.\n"}, "k": {"ques": "Что такое директивы с тремя наклонными чертами (Triple-Slash Directives), их типы", "result": "\n\tДирективы с тремя наклонными чертами используются в TypeScript для того, чтобы пометить \n\tкакие-то части кода как комментарии или для указания того, что код является временным \n\tи его не нужно компилировать.\n\n\tСуществует два типа директив с тремя наклонными чертами:\n\n\t// / - используются для комментариев в коде, которые не будут компилироваться;\n\t// /** - используются для указания временных участков кода, которые также не будут \n\tкомпилироваться.\n\n\tЭти директивы очень полезны для временного отключения частей кода во время \n\tразработки, чтобы не нарушать его работу.\n"}, "w": {"ques": " Что такое внешние объявления переменных (ambient declaration) ", "result": "\n\tВнешние объявления переменных используются для объявления глобальных переменных \n\tили функций, которые могут использоваться в коде, но не обязательно должны \n\tбыть определены в текущем файле. Это позволяет использовать общие API без \n\tнеобходимости импортировать все определения в каждый файл. Например:\n\n\tdeclare var window: any;\n\n\tЭто объявление говорит TypeScript, что переменная window существует в глобальной \n\tобласти видимости и имеет тип any.\n"}, "a": {"ques": "Абстрактный класс в TypeScript", "result": "\n\tАбстрактный класс в TypeScript используется для определения общего поведения \n\tи свойств для группы связанных классов. Он может содержать методы с реализацией \n\tпо умолчанию и может быть унаследован только абстрактными классами или интерфейсами. \n\tАбстрактные классы позволяют определять общий интерфейс для классов, которые \n\tимеют общую структуру и поведение, но могут отличаться в некоторых деталях. Это \n\tпомогает уменьшить дублирование кода и улучшает модульность и расширяемость кода.\n\n\n\tabstract class Animal {\n\t    public name: string;\n\n\t    constructor(name: string) {\n\t        this.name = name;\n\t    }\n\n\t    public abstract bark(): void;\n\t    public abstract walk(): void;\n\t}\n\n\tclass Dog extends Animal {\n\t    bark() {\n\t        console.log(`Woof!`);\n\t    }\n\t    walk() {\n\t        console.log(`Walking...`);\n\t    }\n\t}\n\n\tclass Cat extends Animal {\n\t    bark() {\n\t        console.log(`Meow!`);\n\t    }\n\t    walk() {\n\t        console.log(`Tiptoeing...`);\n\t    }\n\t}\n\n\tlet dog = new Dog(\"Rex\");\n\tlet cat = new Cat(\"Sylvester\");\n\tdog.bark();\n\tdog.walk();\n\tcat.bark();\n\tcat.walk();\n\n\tВ этом примере у нас есть абстрактный класс Animal, который определяет свойства и \n\tметоды, общие для всех животных. От него наследуются классы Dog и Cat, которые \n\tпредоставляют свою реализацию методов bark и walk\n"}, "q": {"ques": " Какие элементы ООП поддерживаются в TypeScript", "result": "\n\tTypeScript поддерживает все основные элементы объектно-ориентированного программирования, включая:\n\n\t-Классы: Вы можете определять классы с свойствами и методами, а также наследовать \n\tот других классов.\n\n\t-Интерфейсы: Интерфейсы позволяют определять наборы свойств и методов, которые должны \n\tбыть реализованы классами, которые их используют.\n\n\t-Перегрузка операторов: TypeScript позволяет перегрузить большинство операторов, \n\tвключая арифметические, логические и операторы присваивания.\n\n\t-Приведение типов (type casting): TypeScript позволяет явно приводить переменные к \n\tдругим типам с помощью оператора “as”.\n\n\t-Полиморфизм: TypeScript поддерживает полиморфизм через наследование и \n\tреализацию интерфейсов.\n\n\t-Статическая типизация: TypeScript обеспечивает строгую проверку типов на этапе \n\tкомпиляции, что помогает предотвратить ошибки времени выполнения.\n"}, "m": {"ques": "Модификаторы доступа в TypeScript", "result": "\n\tДа, TypeScript поддерживает модификаторы доступа. Вы можете использовать \n\tключевые слова: \n\t-public \n\t-private \n\t-protected \n\n\tИспользуются для управления доступом к членам класса. \n\tPublic члены доступны из любого места, \n\tprivate члены могут быть доступны только из текущего класса, \n\tа protected члены могут быть доступны из текущего класса и его потомков.\n"}, "e": {"ques": "Internal Module и External Module", "result": "\n\tРазница между внутренним и внешним модулями в TypeScript касается того, \n\tкак они обрабатываются во время компиляции и как они подключаются к вашему проекту.\n\n\tВнутренний модуль (Internal Module):\n\n\tВнутренним модулем называется модуль, который компилируется вместе с вашим проектом. \n\tТакой модуль доступен только в рамках вашего проекта и не может быть импортирован \n\tили экспортирован из него. Внутренние модули обычно используются для организации \n\tкода внутри вашего проекта и для сокрытия деталей реализации от пользователей вашего кода.\n\n\n\tВнешний модуль (External Module):\n\n\tВнешний модуль - это модуль, который может быть импортирован и экспортирован \n\tиз вашего проекта. Внешние модули обычно хранятся в отдельных файлах с \n\tрасширением .ts или .d.ts и могут быть подключены к вашему проекту с помощью \n\tдирективы import или export. Внешние модули позволяют разделить ваш код на более \n\tмелкие компоненты, которые могут быть использованы и объединены вместе в \n\tразличных проектах.\n"}, "n": {"ques": "Перечисление (enum)", "result": "\n\tВ TypeScript перечисления (enums) - это специализированный тип данных, который \n\tпредставляет собой ограниченный список значений. Эти значения не могут быть \n\tизменены после определения перечисления и не могут иметь никакого другого типа \n\tданных, кроме указанного при определении перечисления.\n\n\tВот пример определения перечисления:\n\n\tenum Suit {\n\t  Clubs,\n\t  Diamonds,\n\t  Hearts,\n\t  Spades\n\t}\n\n\tЗдесь мы определяем перечисление с именем Suit, которое содержит четыре \n\tзначения: Clubs, Diamonds, Hearts и Spades. Мы можем использовать эти значения \n\tв коде, например:\n\n\tlet card = Card.fromFaceValue(10);\n\tcard.suit = Suit.Hearts;\n\tconsole.log(card.getFaceValue() + \" of \" + card.suit);\n"}, "ni": {"ques": "NoImplicitAny", "result": "\n\tNoImplicitAny используется в TypeScript для предотвращения неявного \n\tприведения любых значений к типу any(нужно обязательно указывать тип). Это позволяет обеспечить более \n\tстрогий контроль типов и избежать неожиданного поведения, связанного с \n\tприведением значений к any. Кроме того, это помогает выявлять ошибки \n\tна этапе компиляции и улучшать качество кода.\n"}, "v": {"ques": "“Объединение” (|) и “Пересечение” (&) typescript", "result": "\n\tРазница между объединением (union) и пересечением (intersection) типов \n\tв TypeScript состоит в следующем:\n\n\n\t-Объединение представляет собой тип, который может иметь одно из нескольких \n\tвозможных значений.\tНапример, тип string | number может быть как строкой, так и числом.\n\n\t-Пересечение представляет собой тип, который должен иметь все свойства \n\tуказанных типов.\n\n\t\tinterface Camera {\n\t    takePicture(): void;\n\t\t}\n\n\t\tinterface MobilePhone {\n\t\t    makeCall(): void;\n\t\t}\n\n\t\tconst phoneWithCamera: Camera & MobilePhone = {\n\t\t    takePicture: () => {},\n\t\t    makeCall: () => {}\n\t\t};\n"}, "g": {"ques": "Generic", "result": "\n\tОбщие типы (generic) в TypeScript позволяют создавать классы, интерфейсы, функции и т.д., \n\tкоторые могут работать с различными типами данных без необходимости их явного указания. \n\tЭто позволяет использовать один и тот же код для работы с разными типами данных, что может \n\tупростить код и улучшить его производительность.\n\n\tНапример, можно создать общий класс Animal без указания конкретного типа животного:\n\n\t`class Animal<T> {\n\t\tname: T;\n\n\t\tconstructor(name: T) {\n\t\tthis.name = name;\n\t}\n\t\tspeak() {\n\t\t\tconsole.log(Animal name is: ${this.name});\n\t\t}\n\t}\n\n\tlet dog = new Animal<string>(“Dog”);\n\tdog.speak(); // Outputs: “Animal name is: Dog”`\n\n"}, "l": {"ques": "Какие области видимости доступны в TypeScript", "result": "\n\tВ TypeScript доступны следующие области видимости:\n\n\t-Глобальная область видимости (Global Scope)\n\n\t-Локальная область видимости функции (Function Local Scope)\n\n\t-Область видимости модуля (Module Scope)\n\n\t-Частная область видимости класса (Class Private Scope)\n\n\t-Каждая из этих областей видимости имеет свои особенности и правила \n\t видимости для переменных и функций.\n\n"}, "x": {"ques": "Что такое .map файл, как и зачем его использовать", "result": "\n\tmap файл - это файл, который содержит информацию о том, как исходный код \n\tTypeScript был преобразован в JavaScript. Он содержит информацию о типах, \n\tименах переменных и функциях, а также о других элементах исходного кода.\n\n\t.map файлы используются для отладки TypeScript кода в инструментах разработчика, \n\tтаких как Visual Studio Code или WebStorm. Они позволяют видеть исходные имена \n\tпеременных и функций в JavaScript коде, что облегчает отладку и понимание кода.\n\n\tИспользование .map файлов также может помочь улучшить производительность \n\tJavaScript кода, так как они позволяют избежать лишних преобразований имен \n\tпеременных и функций при компиляции TypeScript кода.\n"}, "j": {"ques": "Можно ли использовать TypeScript в серверной разработке", "result": "\n\tДа, TypeScript можно использовать в серверной разработке. Он широко \n\tиспользуется в Node.js для создания серверных приложений. TypeScript \n\tпозволяет добавлять статическую типизацию к JavaScript-коду, что улучшает\n\tего читаемость и помогает обнаруживать ошибки на ранних стадиях разработки.\n"}, "y": {"ques": "Ключевое слово declare", "result": "\n\tКлючевое слово declare используется в TypeScript для того, чтобы указать, что \n\tнекоторый элемент существует, даже если его ещё не существует в коде. Это может\n\tбыть полезным при определении интерфейсов или типов, которые будут реализованы \n\tили заполнены позже.\n"}, "4": {"ques": "Разница между типами void, never и unknown", "result": "\n\t-Типы void, never, and unknown в TypeScript имеют следующие различия:\n\n\t-Тип void указывает на то, что функция или метод не возвращает значение.\n\n\t-Тип never обозначает значение, которое не может возникнуть в \n\tрезультате выполнения программы.\n\n\t-Тип unknown используется для обозначения значений неизвестного типа. \n\t Он позволяет обрабатывать такие значения безопасным способом, не вызывая ошибок типа.\n"}, "u": {"ques": "Как вы отлавливаете ошибки в TypeScript коде", "result": "\n\tВ TypeScript есть несколько способов отлова ошибок в коде:\n\n\t-Использование строгой типизации: TypeScript позволяет определить типы для переменных \n\tи параметров функций, что помогает обнаруживать ошибки, связанные с несовместимостью типов.\n\n\t-Обработка ошибок с помощью операторов try/catch: Этот подход позволяет перехватывать ошибки \n\tвремени выполнения и обрабатывать их соответствующим образом.\n\n\t-Применение аннотаций @ts-ignore и @ts-expect-error: Эти аннотации позволяют временно подавить \n\tили явно указать на наличие ошибки в коде соответственно.\n\n\t-Использование инструментария для линтинга кода, такого как tslint или eslint, которые могут \n\tобнаруживать различные виды ошибок в коде и выдавать предупреждения.\n"}}